<?php
// Отримуємо значення змінних $a і $b з адресного рядка
$a = $_GET['a'];
$b = $_GET['b'];

// Перевіряємо, чи введені значення є цілими числами
if (is_numeric($a) && is_numeric($b)) {
    // Виконуємо математичні операції
    $sum = $a + $b;
    $product = $a * $b;
    $difference = $a - $b;
    $quotient = $a / $b;

    // Виводимо результати
    echo "Сума: " . $sum . "<br>";
    echo "Добуток: " . $product . "<br>";
    echo "Різниця: " . $difference . "<br>";
    echo "Частка: " . $quotient . "<br>";
} else {
    echo "Будь ласка, введіть цілі числа для обчислень.";
}
?>


?a=5&b=3
